ИнКар.Маркетплейсы/src/Catalogs/МП_ЮлаРазмещенияОбъявлений/МП_ЮлаРазмещенияОбъявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_ЮлаРазмещенияОбъявлений</name>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.МП_ЮлаКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.МП_ЮлаПодкатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДетали</name>
    <type>
      <types>CatalogRef.МП_ЮлаТипыДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДеталей</name>
    <type>
      <types>CatalogRef.МП_ЮлаГруппыДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеДетали</name>
    <type>
      <types>CatalogRef.МП_ЮлаНазванияДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодыРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/Catalogs/МП_ЮлаРазмещенияОбъявлений/ObjectModule.bsl
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитКод = "Код";
	РеквизитТег = "Тег";
	
	
	НаборОбъектов = Новый Массив();
	
	ДобавитьНеПустые(Категория, НаборОбъектов);
	ДобавитьНеПустые(Подкатегория, НаборОбъектов);
	ДобавитьНеПустые(ТипДетали, НаборОбъектов);
	ДобавитьНеПустые(ГруппаДеталей, НаборОбъектов);
	ДобавитьНеПустые(НазваниеДетали, НаборОбъектов);
	
	Коды = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НаборОбъектов, РеквизитКод);
	Тег = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подкатегория, РеквизитТег);
	
	КодыРазмещения = "";
	
	Для Каждого Элемент Из Коды Цикл
		КодыРазмещения = КодыРазмещения + Элемент.Значение + " ";
	КонецЦикла;
	
	КодыРазмещения = КодыРазмещения + Тег;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	Процедура ДобавитьНеПустые(Ссылка, Массив)
		
		Если Не Ссылка.Пустая() Тогда
			Массив.Добавить(Ссылка);
		КонецЕсли;
		
	КонецПроцедуры
#КонецОбласти

#КонецЕсли
